<a href="https://colab.research.google.com/github/Kundan71/EDA-on-IMDB-/blob/main/EDA_on_IMDB_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## You have been hired by a rookie movie producer to help him decide what type of movies to produce and which actors to cast. You have to back your recommendations based on thorough analysis of the data he shared with you which has the list of 3000 movies and the corresponding details.

## As a data scientist, you have to first explore the data and check its sanity.

## Further, you have to answer the following questions:
1. ### <b> Which movie made the highest profit? Who were its producer and director? Identify the actors in that film.</b>
2. ### <b>This data has information about movies made in different languages. Which language has the highest average ROI (return on investment)? </b>
3. ### <b> Find out the unique genres of movies in this dataset.</b>
4. ### <b> Make a table of all the producers and directors of each movie. Find the top 3 producers who have produced movies with the highest average RoI? </b>
5. ### <b> Which actor has acted in the most number of movies? Deep dive into the movies, genres and profits corresponding to this actor. </b>
6. ### <b>Top 3 directors prefer which actors the most? </b>

# Data Exploration

In [ ]:
#Import package
import pandas as pd
import numpy as np

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
file_path = '/content/drive/MyDrive/Colab Notebooks/Module 1/Projects/data/Copy of imdb_data.csv'
imdb_df=pd.read_csv(file_path)

In [ ]:
imdb_df.shape

(3000, 23)

In [ ]:
imdb_df.head()

   id  ...   revenue
0   1  ...  12314651
1   2  ...  95149435
2   3  ...  13092000
3   4  ...  16000000
4   5  ...   3923970

[5 rows x 23 columns]

In [ ]:
imdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     3000 non-null   int64
 1   belongs_to_collection  604 non-null    object
 2   budget                 3000 non-null   int64
 3   genres                 2993 non-null   object
 4   homepage               946 non-null    object
 5   imdb_id                3000 non-null   object
 6   original_language      3000 non-null   object
 7   original_title         3000 non-null   object
 8   overview               2992 non-null   object
 9   popularity             3000 non-null   float64
 10  poster_path            2999 non-null   object
 11  production_companies   2844 non-null   object
 12  production_countries   2945 non-null   object
 13  release_date           3000 non-null   object
 14  runtime                2998 non-null   float64
 15  spoken_languages       2980 non-null   object
 16  status                 3000 non-null   object
 17  tagline                2403 non-null   object
 18  title                  3000 non-null   object
 19  Keywords               2724 non-null   object
 20  cast                   2987 non-null   object
 21  crew                   2984 non-null   object
 22  revenue                3000 non-null   int64
dtypes: float64(2), int64(3), object(18)
memory usage: 539.2+ KB

In [ ]:
type(imdb_df.loc[0,'crew'])

str

In [ ]:
imdb_df.columns

Index(['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue'],
      dtype='object')

In [ ]:
column_to_keep = ['imdb_id', 'budget', 'genres', 'original_language', 'title', 'cast', 'crew', 'revenue']

In [ ]:
imdb_df = imdb_df[column_to_keep]

In [ ]:
# crew,cast,& genres are str data, we will use eval() fn to convert it into real list
def convert_string_to_list(string):
  return eval(string)

In [ ]:
imdb_df.loc[~imdb_df['genres'].isna(),'genres'] = imdb_df.loc[~imdb_df['genres'].isna(),'genres'].apply(convert_string_to_list)
imdb_df.loc[~imdb_df['crew'].isna(),'crew'] = imdb_df.loc[~imdb_df['crew'].isna(),'crew'].apply(convert_string_to_list)
imdb_df.loc[~imdb_df['cast'].isna(),'cast'] = imdb_df.loc[~imdb_df['cast'].isna(),'cast'].apply(convert_string_to_list)

In [ ]:
imdb_df.loc[0,'genres']

[{'id': 35, 'name': 'Comedy'}]

In [ ]:
imdb_df_new = imdb_df.copy()

# **Which movie made the highest profit? Who were its producer and director? Identify the actors in that film.**

In [ ]:
imdb_df_new.describe()

             budget       revenue
count  3.000000e+03  3.000000e+03
mean   2.253133e+07  6.672585e+07
std    3.702609e+07  1.375323e+08
min    0.000000e+00  1.000000e+00
25%    0.000000e+00  2.379808e+06
50%    8.000000e+06  1.680707e+07
75%    2.900000e+07  6.891920e+07
max    3.800000e+08  1.519558e+09

In [ ]:
# we know that budget and revenue can't be 0 so, we need to remove outliers
imdb_df_new.loc[imdb_df_new['budget']<=1000,'budget'] = imdb_df_new.loc[imdb_df_new['budget']>=1000,'budget'].median()
imdb_df_new.loc[imdb_df_new['revenue']<=1000,'revenue'] = imdb_df_new.loc[imdb_df_new['revenue']>=1000,'revenue'].median()

In [ ]:
imdb_df_new.describe()

             budget       revenue
count  3.000000e+03  3.000000e+03
mean   2.708250e+07  6.705811e+07
std    3.492773e+07  1.373917e+08
min    2.500000e+03  1.404000e+03
25%    1.000000e+07  2.947600e+06
50%    1.645000e+07  1.748753e+07
75%    2.900000e+07  6.891920e+07
max    3.800000e+08  1.519558e+09

In [ ]:
imdb_df_new['profit'] = imdb_df_new['revenue'] - imdb_df_new['budget']

In [ ]:
imdb_df_new.head()

     imdb_id    budget  ...   revenue    profit
0  tt2637294  14000000  ...  12314651  -1685349
1  tt0368933  40000000  ...  95149435  55149435
2  tt2582802   3300000  ...  13092000   9792000
3  tt1821480   1200000  ...  16000000  14800000
4  tt1380152  16450000  ...   3923970 -12526030

[5 rows x 9 columns]

In [ ]:
max_profit = imdb_df_new['profit'].max()

In [ ]:
max_profit_movies = imdb_df_new[imdb_df_new['profit'] == max_profit]

In [ ]:
max_profit_movies

        imdb_id     budget  ...     revenue      profit
1761  tt2820852  190000000  ...  1506249360  1316249360

[1 rows x 9 columns]

In [ ]:
max_profit_movies.iloc[0]['crew']

In [ ]:
max_profit_movies_df = max_profit_movies['crew'].values
crew_list = max_profit_movies.iloc[0]['crew']

In [ ]:
producer_list = []
director_list = []
for elem in crew_list:
  if elem['job'] == 'Producer':
    producer_list.append(elem['name'])
    
  if elem['job'] == 'Director':
    director_list.append(elem['name'])

In [ ]:
director_list

['James Wan']

In [ ]:
max_profit_movies.iloc[0]['cast']

In [ ]:
actor_list_df = max_profit_movies.iloc[0]['cast']

In [ ]:
actor_list = []
#male_actor_list = []
for elem in actor_list_df:
  actor_list.append(elem['name'])
    
  #if elem['gender'] == 2:
    #male_actor_list.append(elem['name'])

In [ ]:
actor_list

# **This data has information about movies made in different languages. Which language has the highest average ROI (return on investment)?** ROI = (Profit/budget)*100

In [ ]:
imdb_df_new['roi'] = imdb_df_new['profit']/imdb_df_new['budget']*100

In [ ]:
imdb_df_new.head()

     imdb_id    budget  ...    profit          roi
0  tt2637294  14000000  ...  -1685349   -12.038207
1  tt0368933  40000000  ...  55149435   137.873588
2  tt2582802   3300000  ...   9792000   296.727273
3  tt1821480   1200000  ...  14800000  1233.333333
4  tt1380152  16450000  ... -12526030   -76.146079

[5 rows x 10 columns]

In [ ]:
roi_la_df = imdb_df_new.groupby('original_language')['roi'].mean().reset_index()

In [ ]:
max_roi_lan = roi_la_df[roi_la_df['roi'] == roi_la_df['roi'].max()]['original_language']

In [ ]:
max_roi_lan

18    ko
Name: original_language, dtype: object

# **Find out the unique genres of movies in this dataset.**

In [ ]:
imdb_no_null_genres_df = imdb_df_new[~imdb_df_new['genres'].isna()]

In [ ]:
imdb_no_null_genres_df.shape

(2993, 10)

In [ ]:
genres_list = []
for index,movie in imdb_no_null_genres_df.iterrows():
  for elem in movie['genres']:
    genres_list.append(elem['name'])

In [ ]:
set(genres_list)

{'Action',
 'Adventure',
 'Animation',
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Family',
 'Fantasy',
 'Foreign',
 'History',
 'Horror',
 'Music',
 'Mystery',
 'Romance',
 'Science Fiction',
 'TV Movie',
 'Thriller',
 'War',
 'Western'}

# **Make a table of all the producers and directors of each movie. Find the top 3 producers who have produced movies with the highest average RoI?**

# **Hint**
![hint.JPG]()

In [ ]:
imdb_no_null_crew_df = imdb_df_new[~imdb_df_new['crew'].isna()]

In [ ]:
imdb_no_null_crew_df.shape

(2984, 10)

In [ ]:
#create fn to get producer and director list from each rows of data
def get_producer_and_director(crew):
  try:
    producers_list = []
    directors_list = []
    for elem in crew:
      if elem['job'] == 'Producer':
        producers_list.append(elem["name"])
      if elem['job'] == 'Director':
        directors_list.append(elem['name'])
    return producers_list, directors_list

  except:
    return [],[]

In [ ]:
get_producer_and_director(imdb_no_null_crew_df.loc[1,'crew'])

(['Whitney Houston', 'Mario Iscovich', 'Debra Martin Chase'],
 ['Garry Marshall'])

In [ ]:
imdb_df_new[['producer','director']] = imdb_df_new.apply(lambda row: get_producer_and_director(row['crew']),axis=1,result_type='expand')

In [ ]:
imdb_df_new.head()

     imdb_id  ...           director
0  tt2637294  ...       [Steve Pink]
1  tt0368933  ...   [Garry Marshall]
2  tt2582802  ...  [Damien Chazelle]
3  tt1821480  ...      [Sujoy Ghosh]
4  tt1380152  ...   [Jong-seok Yoon]

[5 rows x 12 columns]

In [ ]:
list_p = []
list_roi = []
for index,movie in imdb_df_new.iterrows():
  for elem in movie['producer']:
    list_p.append(elem)
    list_roi.append(movie['roi'])

In [ ]:
len(list_p)

6011

In [ ]:
len(list_roi)

6011

In [ ]:
dict_ = {'producer':list_p, 'roi':list_roi}
producer_df = pd.DataFrame(dict_)

In [ ]:
producer_df.head()

             producer         roi
0        Andrew Panay  -12.038207
1     Whitney Houston  137.873588
2      Mario Iscovich  137.873588
3  Debra Martin Chase  137.873588
4     David Lancaster  296.727273

In [ ]:
top_producer_roi = producer_df.groupby('producer')['roi'].mean().reset_index()

In [ ]:
top_producer_roi = top_producer_roi.sort_values('roi')

In [ ]:
top_producer_roi.tail(3)

         producer           roi
1185   Gregg Hale  4.132333e+05
2878  Robin Cowie  4.132333e+05
146    Amir Zbeda  1.288939e+06

# **Which actor has acted in the most number of movies? Deep dive into the movies, genres and profits corresponding to this actor.**

In [ ]:
imdb_no_null_cast_df = imdb_df_new[~imdb_df_new['cast'].isna()]

In [ ]:
imdb_no_null_cast_df.shape

(2987, 12)

In [ ]:
def get_actors_name(actor):
  try:
    actors_list = []
    for elem in actor:
      actors_list.append(elem["name"])
    return actors_list

  except:
    return []

In [ ]:
imdb_df_new['actors'] = imdb_df_new.apply(lambda row: get_actors_name(row['cast']),axis=1)

In [ ]:
imdb_df_new.head()

     imdb_id  ...                                             actors
0  tt2637294  ...  [Rob Corddry, Craig Robinson, Clark Duke, Adam...
1  tt0368933  ...  [Anne Hathaway, Julie Andrews, H√©ctor Elizond...
2  tt2582802  ...  [Miles Teller, J.K. Simmons, Melissa Benoist, ...
3  tt1821480  ...  [Vidya Balan, Nawazuddin Siddiqui, Parambrata ...
4  tt1380152  ...  [Kim Kang-woo, Jo Jae-hyeon, Park Si-yeon, Kim...

[5 rows x 13 columns]

In [ ]:
type(imdb_df.loc[0,'genres'])

list

In [ ]:
list_actor = []
list_genres = []
list_profit = []
for index,movie in imdb_df_new.iterrows():
  for elem in movie['actors']:
    list_actor.append(elem)
    list_profit.append(movie['profit'])
    list_genres.append(movie['genres'])

In [ ]:
len(list_actor)

61811

In [ ]:
unique_actors = set(list_actor)

In [ ]:
unique_count = []
for i in unique_actors:
  unique_count.append(list_actor.count(i))

In [ ]:
unique_actor_dict = dict(zip(list(unique_actors),unique_count))

In [ ]:
top_actor_wrt_no_of_movies = max(unique_count)

In [ ]:
top_actor_list = []
for index,value in unique_actor_dict.items():
  if value == top_actor_wrt_no_of_movies:
    top_actor_list.append(index)
    #print(f"{index} is top actor and acted in total of {value} movies")

In [ ]:
dict_of_actors = {'actors':list_actor, 'genres':list_genres, 'profit':list_profit}
actors_df = pd.DataFrame(dict_of_actors)

In [ ]:
actors_df.head()

           actors                          genres   profit
0     Rob Corddry  [{'id': 35, 'name': 'Comedy'}] -1685349
1  Craig Robinson  [{'id': 35, 'name': 'Comedy'}] -1685349
2      Clark Duke  [{'id': 35, 'name': 'Comedy'}] -1685349
3      Adam Scott  [{'id': 35, 'name': 'Comedy'}] -1685349
4     Chevy Chase  [{'id': 35, 'name': 'Comedy'}] -1685349

In [ ]:
def actors_details(actor):
  genres = []
  net_profit = 0
  for index,cols in actors_df.iterrows():
    if cols['actors'] == actor:
      net_profit = net_profit + cols['profit']
      for elem in cols['genres']:
        genres.append(elem['name'])
  return print(f'{actor} had made {net_profit} net profit in 30 movies and worked in several genres such as {set(genres)}')

In [ ]:
for actor in top_actor_list:
  actors_details(actor)

Robert De Niro had made 802612528 net profit in 30 movies and worked in several genres such as {'Horror', 'Crime', 'Thriller', 'Mystery', 'War', 'Comedy', 'Documentary', 'History', 'Action', 'Drama', 'Romance'}
Samuel L. Jackson had made 6730538676 net profit in 30 movies and worked in several genres such as {'Horror', 'Romance', 'Crime', 'Thriller', 'Science Fiction', 'Mystery', 'Fantasy', 'Family', 'Animation', 'Comedy', 'Documentary', 'Action', 'Western', 'Drama', 'Adventure'}

# **Top 3 directors prefer which actors the most?**

In [ ]:
imdb_df_new.head()

     imdb_id  ...                                             actors
0  tt2637294  ...  [Rob Corddry, Craig Robinson, Clark Duke, Adam...
1  tt0368933  ...  [Anne Hathaway, Julie Andrews, H√©ctor Elizond...
2  tt2582802  ...  [Miles Teller, J.K. Simmons, Melissa Benoist, ...
3  tt1821480  ...  [Vidya Balan, Nawazuddin Siddiqui, Parambrata ...
4  tt1380152  ...  [Kim Kang-woo, Jo Jae-hyeon, Park Si-yeon, Kim...

[5 rows x 13 columns]

In [ ]:
list_director = []
list_actors = []
list_roi = []
for index, cols in imdb_df_new.iterrows():
  for elem in cols['director']:
    list_director.append(elem)
    list_actors.append(cols['actors'])
    list_roi.append(cols['roi'])

In [ ]:
director_dict = {'director':list_director, 'actors':list_actors, 'roi':list_roi}
director_df = pd.DataFrame(director_dict)

In [ ]:
director_df.head()

          director  ...          roi
0       Steve Pink  ...   -12.038207
1   Garry Marshall  ...   137.873588
2  Damien Chazelle  ...   296.727273
3      Sujoy Ghosh  ...  1233.333333
4   Jong-seok Yoon  ...   -76.146079

[5 rows x 3 columns]

In [ ]:
director_avg_roi_df = director_df.groupby('director')['roi'].mean().reset_index()

In [ ]:
director_avg_roi_df.head()

          director         roi
0     A.J. Edwards  -99.568888
1  A.R. Murugadoss  735.164835
2       Aaron Katz  517.000000
3     Aaron Norris  -60.813793
4    Aaron Seltzer  302.739330

In [ ]:
max_roi_dircetor = director_avg_roi_df.sort_values('roi')

In [ ]:
max_roi_dircetor.tail(3)

            director           roi
1423  Park Hoon-Jung  2.215690e+05
390    Daniel Myrick  4.132333e+05
1412       Oren Peli  1.288939e+06

In [ ]:
# actors preferd by top three director are
def actors_prefered_by_directors(elem):
  prefered_actors = []
  for index,cols in director_df.iterrows():
    if cols['director'] == elem:
      for elem in cols['actors']:
        prefered_actors.append(elem)
  return print(f'{elem} preferd actors are {set(prefered_actors)}')

In [ ]:
top_3_directors = ['Park Hoon-Jung','Daniel Myrick','Oren Peli']

In [ ]:
for directors in top_3_directors:
  actors_prefered_by_directors(directors)

Lee Eun-woo preferd actors are {'Lee Eun-woo', 'Jung Suk-won', 'Jeong Man-sik', 'Sung Yu-bin', 'Kim Sang-ho', 'Choi Min-sik'}
Jackie Hallex preferd actors are {'Jim King', 'Joshua Leonard', 'Michael C. Williams', 'Jackie Hallex', 'Bob Griffith', 'Ed Swanson', 'Mark Mason', 'Heather Donahue', 'Patricia DeCou', 'Sandra S√°nchez'}
Ashley Palmer preferd actors are {'Katie Featherston', 'Micah Sloat', 'Ashley Palmer', 'Mark Fredrichs', 'Amber Armstrong'}